## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## AWS-EKS :thumbsup:
**Dir**: AWS-EKS
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_route_table.public[0] has changed
!   resource "aws_route_table" "public" {
        id               = "rtb-041819215bb1660ed"
!       route            = [
+           {
+               carrier_gateway_id         = ""
+               cidr_block                 = "0.0.0.0/0"
+               core_network_arn           = ""
+               destination_prefix_list_id = ""
+               egress_only_gateway_id     = ""
+               gateway_id                 = "igw-0cd4f4e23c22bce6e"
+               ipv6_cidr_block            = ""
+               local_gateway_id           = ""
+               nat_gateway_id             = ""
+               network_interface_id       = ""
+               transit_gateway_id         = ""
+               vpc_endpoint_id            = ""
+               vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "dev"
            "Name"        = "eks-vpc-public"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "eks-cluster"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags_all                  = (known after apply)
+       version                   = "1.27"

+       kubernetes_network_config {
+           ip_family         = (known after apply)
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = [
+               "sg-0423513137dfcf1fd",
            ]
+           subnet_ids                = [
+               "subnet-070a323bb2ea30762",
+               "subnet-09d16a71108a23118",
            ]
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "eks-cluster-cluster-"
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "eks-cluster-cluster"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "logs:CreateLogGroup",
                            ]
+                           Effect   = "Deny"
+                           Resource = "*"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] will be created
+   resource "aws_eks_node_group" "this" {
+       ami_type               = (known after apply)
+       arn                    = (known after apply)
+       capacity_type          = "SPOT"
+       cluster_name           = "eks-cluster"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = [
+           "t3.medium",
        ]
+       node_group_name        = (known after apply)
+       node_group_name_prefix = "green-"
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = [
+           "subnet-070a323bb2ea30762",
+           "subnet-09d16a71108a23118",
        ]
+       tags                   = {
+           "Name" = "green"
        }
+       tags_all               = {
+           "Name" = "green"
        }
+       version                = "1.27"

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = (known after apply)
        }

+       scaling_config {
+           desired_size = 3
+           max_size     = 4
+           min_size     = 3
        }

+       timeouts {}

+       update_config {
+           max_unavailable            = (known after apply)
+           max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "EKSNodeAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "EKS managed node group IAM role"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "green-eks-node-group-"
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_launch_template.this[0] will be created
+   resource "aws_launch_template" "this" {
+       arn                    = (known after apply)
+       default_version        = (known after apply)
+       description            = "Custom launch template for green EKS managed node group"
+       id                     = (known after apply)
+       latest_version         = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "green-"
+       tags_all               = (known after apply)
+       update_default_version = true
+       vpc_security_group_ids = [
+           "sg-063b0bd80b89082db",
+           "sg-0a4fbafd03804022b",
        ]

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = 2
+           http_tokens                 = "required"
+           instance_metadata_tags      = (known after apply)
        }

+       monitoring {
+           enabled = true
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Name" = "green"
            }
        }
+       tag_specifications {
+           resource_type = "network-interface"
+           tags          = {
+               "Name" = "green"
            }
        }
+       tag_specifications {
+           resource_type = "volume"
+           tags          = {
+               "Name" = "green"
            }
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| AWS-EKS | default | 101.25 | 101.25 | 0.00|
| | **Total** | **101.25** | **101.25** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
